#ifndef TASK_APPMAIN_STAGEMAP_MACHINEOPERATION_H_
#define TASK_APPMAIN_STAGEMAP_MACHINEOPERATION_H_


//=================================================================================================
// 稼働状態（初期化処理)
//=================================================================================================
void Task_App_Stagemap_MachineOperation_Init(void);


//=================================================================================================
// 稼働状態（メイン処理)
//=================================================================================================
void Task_App_Stagemap_MachineOperation_Proc(void);


//=================================================================================================
// 稼働状態（終了処理)
//=================================================================================================
void Task_App_Stagemap_MachineOperation_End(void);


#endif /* TASK_APPMAIN_STAGEMAP_MACHINEOPERATION_H_ */
